[Portuguese]
Please connect the 2.4GHz USB dongle of the device to your computer's USB port for pairing. = Ligue o adaptador USB 2,4GHz do dispositivo à porta USB do seu computador para emparelhar.
Please follow the steps below for pairing. = Siga os passos indicados abaixo para tentar emparelhar.
1. Set the connection switch to the RF 2.4GHz mode. = 1. Deslize o interruptor de ligação para o modo RF 2,4GHz.
2. Press and hold the left button, right button and DPI button for 3 seconds. = 2. Mantenha pressionado o botão esquerdo, o botão direito e o botão de PPP durante 3 segundos.
3. Click the "Pair" button on the interface. = 3. Clique no botão “Emparelhar” na interface.	
1. Connect the device to your computer with the USB cable. = 1. Ligue o dispositivo ao seu computador com o cabo USB.
2. Click the "Pair" button on the interface. = 2. Clique no botão “Emparelhar” na interface.

Pair = Emparelhar
Close = Fechar
Pairing = A emparelhar
Pairing completed = Emparelhamento concluído
Pairing failed = O emparelhamento falhou

1. Connect the headset with a USB cable and switch to 2.4GHz mode. = 1. Ligue o dispositivo ao computador com um cabo USB e defina o comutador de ligação para o modo RF de 2,4 GHz.
2. Press and hold the function button for 15 seconds until you hear the beep sounds. = 2. Mantenha pressionado o botão de função por 15 segundos até ouvir avisos sonoros.
Please unplug and re-plug the 2.4 GHz receiver(dongle), power off the headset and then switch it to RF 2.4 GHz mode. = Desligue e volte a inserir o recetor de RF de 2,4 GHz. Desligue o dispositivo e, em seguida, mude o dispositivo para o modo RF de 2,4 GHz.